Revit 2027 API
UpdaterRegistry.IsUpdaterRegistered(UpdaterId) Method
 Checks whether updater with the given id is registered
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsUpdaterRegistered(
	UpdaterId id
)
Public Shared Function IsUpdaterRegistered (
	id As UpdaterId
) As Boolean
public:
static bool IsUpdaterRegistered(
	UpdaterId^ id
)
static member IsUpdaterRegistered :
        id : UpdaterId -> bool
Parameters
id UpdaterId
 Id of the updater being tested.
Return Value
Boolean
 Returns true if the updater is registered.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UpdaterRegistry Class
IsUpdaterRegistered Overload
Autodesk.Revit.DB Namespace